web/src/test/resources/receive-question.xml

<!--
  ~ Copyright (C) 2016 Inera AB (http://www.inera.se)
  ~
  ~ This file is part of sklintyg (https://github.com/sklintyg).
  ~
  ~ sklintyg is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ sklintyg is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:add="http://www.w3.org/2005/08/addressing"
        xmlns:qa="urn:riv:insuranceprocess:healthreporting:medcertqa:1"
        xmlns:hr="urn:riv:insuranceprocess:healthreporting:2"
        xmlns:urn="urn:riv:insuranceprocess:healthreporting:SendMedicalCertificateQuestionResponder:1">
  <soapenv:Header>
    <add:To>target</add:To>
  </soapenv:Header>
  <soapenv:Body>
    <ReceiveMedicalCertificateQuestion xmlns="urn:riv:insuranceprocess:healthreporting:ReceiveMedicalCertificateQuestionResponder:1">
      <Question>
        <fkReferens-id>123</fkReferens-id>
        <amne>Komplettering_av_lakarintyg</amne>
        <fraga>
          <qa:meddelandeText>Tomten kan inte vara sjukskriven den 24e december!</qa:meddelandeText>
          <qa:signeringsTidpunkt>2012-12-22T21:00:00</qa:signeringsTidpunkt>
        </fraga>
        <avsantTidpunkt>2012-12-22T21:05:00</avsantTidpunkt>
        <fkKontaktInfo>
          <qa:kontakt>Dan Eliasson</qa:kontakt>
        </fkKontaktInfo>
        <adressVard>
          <qa:hosPersonal>
            <hr:personal-id root="1.2.752.129.2.1.4.1" extension="Personal HSA-ID"/>
            <hr:fullstandigtNamn>En Läkare</hr:fullstandigtNamn>
            <hr:forskrivarkod>1234567</hr:forskrivarkod>
            <hr:enhet>
              <hr:enhets-id root="1.2.752.129.2.1.4.1" extension="IFV1239877878-103F"/>
              <hr:arbetsplatskod root="1.2.752.29.4.71" extension="123456789011"/>
              <hr:enhetsnamn>Kir mott</hr:enhetsnamn>
              <hr:postadress>Lasarettsvägen 13</hr:postadress>
              <hr:postnummer>85150</hr:postnummer>
              <hr:postort>Sundsvall</hr:postort>
              <hr:telefonnummer>060-1818000</hr:telefonnummer>
              <hr:vardgivare>
                <hr:vardgivare-id root="1.2.752.129.2.1.4.1" extension="VardgivarId"/>
                <hr:vardgivarnamn>Landstinget Norrland</hr:vardgivarnamn>
              </hr:vardgivare>
            </hr:enhet>
          </qa:hosPersonal>
        </adressVard>
        <fkMeddelanderubrik>Jul i fara</fkMeddelanderubrik>
        <fkKomplettering>
          <qa:falt>Fält 8b</qa:falt>
          <qa:text>Vänligen ändra 'längst till och med (år, månad, dag)' till den 23e december.</qa:text>
        </fkKomplettering>
        <fkSistaDatumForSvar>2013-12-23</fkSistaDatumForSvar>
        <lakarutlatande>
          <qa:lakarutlatande-id>b2f6d5bc-2f50-4623-9ce9-bf1ee5404347</qa:lakarutlatande-id>
          <qa:signeringsTidpunkt>2013-11-30T12:12:12</qa:signeringsTidpunkt>
          <qa:patient>
            <hr:person-id root="1.2.752.129.2.1.3.1" extension="19121212-1212"/>
            <hr:fullstandigtNamn>Tomten</hr:fullstandigtNamn>
          </qa:patient>
        </lakarutlatande>
      </Question>
    </ReceiveMedicalCertificateQuestion>
  </soapenv:Body>
</soapenv:Envelope>
