web/src/test/resources/integrationtestTemplates/receiveMedicalCertificateQuestion.v1.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:add="http://www.w3.org/2005/08/addressing"
xmlns:urn="urn:riv:insuranceprocess:healthreporting:ReceiveMedicalCertificateQuestionResponder:1"
xmlns:urn1="urn:riv:insuranceprocess:healthreporting:medcertqa:1"
xmlns:urn2="urn:riv:insuranceprocess:healthreporting:2">
   <soapenv:Header>
      <add:To>WC12323234</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ReceiveMedicalCertificateQuestion>
         <urn:Question>
            <urn:fkReferens-id>$data.fkReferens$</urn:fkReferens-id>
            <urn:amne>$data.amne$</urn:amne>
            <urn:fraga>
               <urn1:meddelandeText>Text</urn1:meddelandeText>
               <urn1:signeringsTidpunkt>2014-12-09T11:00:00.000</urn1:signeringsTidpunkt>
            </urn:fraga>
            <urn:avsantTidpunkt>2014-12-09T21:00:00.000</urn:avsantTidpunkt>
            <urn:adressVard>
               <urn1:hosPersonal>
                  <urn2:personal-id root="1.2.752.129.2.1.4.1" extension="TSTNMT2321000156-103F"/>
                  <urn2:fullstandigtNamn>Jan Nilsson</urn2:fullstandigtNamn>
                  <urn2:enhet>
                     <urn2:enhets-id root="1.2.752.129.2.1.4.1" extension="TSTNMT2321000156-1039"/>
                     <urn2:enhetsnamn>WebCert-Integration Enhet 1</urn2:enhetsnamn>
                     <urn2:vardgivare>
                        <urn2:vardgivare-id root="1.2.752.129.2.1.4.1" extension="TSTNMT2321000156-1002"/>
                        <urn2:vardgivarnamn>WebCert-Integration Vårdgivare 1</urn2:vardgivarnamn>
                     </urn2:vardgivare>
                  </urn2:enhet>
               </urn1:hosPersonal>
            </urn:adressVard>

            <urn:lakarutlatande>
               <urn1:lakarutlatande-id>$data.intygsId$</urn1:lakarutlatande-id>
               <urn1:signeringsTidpunkt>$data.signeringsTidpunkt$</urn1:signeringsTidpunkt>
               <urn1:patient>
                  <urn2:person-id root="1.2.752.129.2.1.3.1" extension="19121212-1212"/>
                  <urn2:fullstandigtNamn>Test Testsson</urn2:fullstandigtNamn>
               </urn1:patient>
            </urn:lakarutlatande>
         </urn:Question>
      </urn:ReceiveMedicalCertificateQuestion>
   </soapenv:Body>
</soapenv:Envelope>
>>

brokenrequest() ::= <<
<not-even-valid-xml>This mess will trigger a soapfault</xml>
>>
