ServiceInteractions/riv/insuranceprocess/healthreporting/trunk/ReceiveMedicalCertificateQuestion/Test-consumer/src/main/resources/clientcall.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <ns3:To xmlns:ns3="http://www.w3.org/2005/08/addressing"
            xmlns:ns2="urn:riv:insuranceprocess:healthreporting:ReceiveMedicalCertificateQuestionResponder:1"
            xmlns="urn:riv:insuranceprocess:healthreporting:1">FKTransform</ns3:To>
    </soap:Header>
    <soap:Body>
        <ns2:ReceiveMedicalCertificateQuestion xmlns="urn:riv:insuranceprocess:healthreporting:1"
            xmlns:ns2="urn:riv:insuranceprocess:healthreporting:ReceiveMedicalCertificateQuestionResponder:1"
            xmlns:ns3="http://www.w3.org/2005/08/addressing">
            <ns2:question>
                <meddelande-id>Referens till meddelande instansen</meddelande-id>
                <amne>Avstamningsmote</amne>
                <meddelandetyp>Fraga_fran_varden</meddelandetyp>
                <meddelanderubrik>Rubrik</meddelanderubrik>
                <meddelandetext>Meddelandetext</meddelandetext>
                <avsantTidpunkt>2010-06-09T12:21:01.309+02:00</avsantTidpunkt>
                <mottagare>
                    <organisation>
                        <organisations-id>202100-5521</organisations-id>
                        <organisationsnamn>Försäkringskassan</organisationsnamn>
                    </organisation>
                </mottagare>
                <avsandare>
                    <hosPersonal>
                        <personal-id>
                            <id>Personal HSA-ID</id>
                            <oid>1.2.752.129.2.1.4.1</oid>
                        </personal-id>
                        <fullstandigtNamn>Erik Åselius</fullstandigtNamn>
                        <enhet>
                            <enhets-id>
                                <id>Enköpings lasaretts HSA-ID</id>
                                <oid>1.2.752.129.2.1.4.1</oid>
                            </enhets-id>
                            <enhetsnamn>Kir mott UAS/KIR</enhetsnamn>
                            <postadress>Akademiska sjukhuset</postadress>
                            <postnummer>751 85</postnummer>
                            <postort>Uppsala</postort>
                            <telefonnummer>018-611 45 30</telefonnummer>
                            <vardgivare>
                                <vardgivare-id>
                                    <id>Uppsala landstings HSA-ID</id>
                                    <oid>1.2.752.129.2.1.4.1</oid>
                                </vardgivare-id>
                                <vardgivarnamn>Landstinget i Uppsala</vardgivarnamn>
                            </vardgivare>
                        </enhet>
                    </hosPersonal>
                </avsandare>
                <lakarutlatande>
                    <lakarutlatande-id>xxx</lakarutlatande-id>
                    <avsantTidpunkt>2010-06-09T12:21:01.310+02:00</avsantTidpunkt>
                    <patient>
                        <person-id>
                            <id>19430811-7094</id>
                            <oid>1.2.752.129.2.1.3.1</oid>
                        </person-id>
                        <fornamn>Lab</fornamn>
                        <efternamn>Testsson</efternamn>
                    </patient>
                </lakarutlatande>
            </ns2:question>
        </ns2:ReceiveMedicalCertificateQuestion>
    </soap:Body>
</soap:Envelope>
